export default {
    emoji: {
        scene: {
            data_update: {
                start: "🤖  👷  ☑ , 👆  🆘  ⛔  👆  👪.\n",
                enter_group: "⛔  👆  👪.",
                detail: "Необходимо ввести свою группу в точности как указано на сайте к примеру \"407\", \"102-тэоэ\".\n\n" +
                    "Если группа будет введена не верно, бот не сможет найти Ваше расписание, но вы можете запросто ввести свой данные заново - написав \"Начать\"\n\n" +
                    "Как правильно:\n✔ 107\n✔ 10\n✔ 201-3\n✔ 517з\n\n" +
                    "Как НЕ правильно:\n❌ \"107\"\n❌ группа 201-3",
                success: "👏!\n" +
                    "😀  👆  💪  🍕  ⚙️  🤖.",
                end: "✍ \" 😀 \" ⚖️ \" 🌃 \" 🔎  😱  👆  📆 ."
            }
        },
        button: {
            today: "😀",
            tomorrow: "🌃",
            after_tomorrow: "📆  ⏮  🌃",
            detail: "🌖  ℹ",
            week: "🗓",
            other: "💞",
            call_admins: "🤙  🏢",
            reference: "🤖  🆘",
            ads: "🆘  ⏮  ✍  🗞",
            prev: "🔙  📆",
            see: "👀",
            reset_data: "⏲  💽",
            unsubscribe: "✉  ⚪️ ➡️  📰",
            subscribe: "👱 📔  📰",
            start: "▶"
        },
        ads: "Срочная помощь студентам в написании работ.\n\n" +
            "Процесс заказа работы Zaochnik. Довольно прост. После ваш личный помощник найдет подходящего эксперта,проконтролирует, чтобы задание было выполнено в срок и после оплаты передаст работу вам\n\n" +
            "Вы сможете отслеживать процесс выполнения задания 24 часа в сутки. Корректировки в готовую работу вносятся бесплатно\n\n" +
            "Преимущество сервиса - наличие официального договора между компанией и клиентом. Это гарантия серьёзного отношения к своим обязательствам, и ваш заказ будет выполнен качественно и в срок\n\n" +
            "Посмотреть цены -> https://vk.cc/aAOc4w",
        call_admins: {
            caused: "🏢  👊  👨‍🚒  ❗\n" +
                "🙏  ⌛",
            error: "👐 , ❌  📉 & ⓜ 🚫  🚚 .\n" +
                "🔄  🔂  ✔  🐥  🕖"
        },
        newsletter: {
            subscribed: "👆  ✔️  🔜  👱 📔  🤖  📰 .",
            unsubscribed: "👆  ✔️  🔜  ✉  ⚪️ ➡️  🤖  📰 ."
        },
        actual: "🤚  🆙 -- 📅  📆  🔙  👆  💻  👱 📔 ⓜ ❗",
        timetable: {
            start: "⭕ 📆  ➖  🔎 ⭕",
            end: "⭕ 📆  🌇 ⭕",
            discipline: "🎓: ",
            teacher: "👨‍🏫: ",
            num: "🔢: №",
            cabinet: "🗄."
        },
        other: (context) => {
            let template = "💞  ⚠:\n\n"

            template += "📌 🆘  🆘  🔛  🤖?\n" +
                "🖊 \" 🆘  🤖 \" & 🔜  🈺  📄  ⏮  📛  🤖 , 🚮  🕹 & 👨‍👩‍👦 . 🆘  🔌  ❔  🌟  ❔ .\n\n"

            template += "🆘 🙆  ⚠  ❓  ⚖️  👆  💚  🤔  👍  💭  🤖  ❓ \n" +
                "🖊 \" 🤙  🏢 \" & 👥  🔜  💬  👆 .\n\n"

            template += "⛔ ⚒  ❌  🕐 ❔  🛬  💽  ❓  💚  🔀  👆  👪\n" +
                "🖊 \" ⏲  📐 \".\n\n"

            if (context.user.subscribe.param) {
                template += "🚀 🚫  💚  🚧  🆙  📅  ⏮  🌐  🤖  📰  🚫 🔜  ❓\n" +
                    "🖊  🔛 \" ✉  ⚪️ ➡️  📰 \" 🖱 \n\n"
            } else {
                template += "🚀 👆  💚  🚧  🆙  📅  ⏮  🌐  🤖  📰  ❓\n" +
                    "🖊  🔛 \" 👱 📔  📰 \" 🖱 & 🥇  💭  🔃  👪  📰 & 🤖  🔧 .\n\n"
            }
            return template
        },
        not_found: "🚫  🔎",
        spam: "⚠ 🆘. ⚠ \n\n" +
            "📧  💪  ❎ .\n" +
            "⏭  🔂  🎏  ✔ , ⚒  😊  👈  👆  🆘  👉 , ↩️  🆘  🎏  ✔  🔜  🚫  🔀\n\n" +
            "🚥  🤖  🚫  📨  👆  📆 , ✅  👈  👆  📐  ☑ . 🔀  📐 , ✍ \" ▶ \".\n\n" +
            "🚥  👆  😊  👈  🌐  ☑ & 🕸  ✔️  📆  ✔  📆 , ✍  👨‍👩‍👦  🏢 , 👥  🔜  🔄  🆘  👆"
    },
    name: "Эмодзи"
}
